src/cf/DataProcessors/бпсНастройкиСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>бпсНастройкиСогласования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧНастройкиПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеУведомлятьОЗадачахПочтой</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДПользователяТелеграмм</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧРегистрАдресации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеАдресации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/бпсНастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бпсНастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеУведомлятьОЗадачахПочтой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДПользователяТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/бпсСтатусыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>бпсСтатусыОбъектов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсСтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/бпсУчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>бпсУчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьТиповыеСредства1сПриОтправкеПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPАутентификация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бпсВариантыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Comment>Имя отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПолучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераВходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервераИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособPOP3Аутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бпсСпособыPOP3Аутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособSMTPАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бпсСпособыSMTPАутентификации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВходНаСерверПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/бпсНастройкиСогласования/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьДляРегистраАдресацииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.ЗаполнитьТЧРегистрАдресации();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТЧРегистрАдресации(Команда)
	ЗаполнитьДляРегистраАдресацииНаКлиенте();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДляРегистраАдресацииНаКлиенте()
	ЗаполнитьДляРегистраАдресацииНаСервере();
	Если Объект.ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи
		И Объект.ТЧРегистрАдресации.Количество() = 0 Тогда
		Сообщить("Не требуется дозаполнять регистр адресации");
	Конецесли;	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьАвтоНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.ЗаполнитьАвто();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	УстановитьВидимостьДоступность();	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи = Истина;
	ЗаполнитьАвтоНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ДекорацияПояснение.Видимость = Ложь;
	Элементы.ДекорацияПояснениеТЧНастройкиПользователей.Видимость = Ложь;
	Элементы.ГруппаСистемнаяУчетнаяЗаписьПользователя.Видимость = Ложь;
	Элементы.ТЧРегистрАдресацииОчередь.Видимость = Ложь;
	Элементы.ПредметСогласования.Видимость = Ложь;
	
	Если Объект.ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи Тогда
		Если Объект.ТЧРегистрАдресации.Количество() > 0	Тогда			
			Элементы.ДекорацияПояснение.Видимость = Истина;
		Конецесли;		
	Иначе
		Элементы.ТЧРегистрАдресацииОчередь.Видимость = Истина;
		Элементы.ПредметСогласования.Видимость = Истина;
	Конецесли;
		
	Если Объект.ТЧНастройкиПользователей.Количество() > 0 Тогда
		Элементы.ДекорацияПояснениеТЧНастройкиПользователей.Видимость = Истина;
	Конецесли;	
	СистемнаяУчетнаяЗаписьЭлектроннойПочты = ПредопределенноеЗначение("Справочник.бпсУчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты");
	Если ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.АдресЭлектроннойПочты)
		И ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.ВремяОжидания) 
		И ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.ИмяПользователя) 
		И ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.Пароль) 
		И ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.ПортСервераИсходящейПочты)
		И ЗначениеЗаполнено(СистемнаяУчетнаяЗаписьЭлектроннойПочты.СерверИсходящейПочты) Тогда
	Иначе
		Элементы.ГруппаСистемнаяУчетнаяЗаписьПользователя.Видимость = Истина;
	Конецесли;
КонецПроцедуры 

&НаСервере
Процедура КомандаСформироватьЗаписиВРегистрАдресацииНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.СформироватьЗаписиВРегистрАдресации();
КонецПроцедуры


&НаКлиенте
Процедура КомандаСформироватьЗаписиВРегистрАдресации(Команда)
	КомандаСформироватьЗаписиВРегистрАдресацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьТЧНастройкиПользователейНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.ЗаполнитьТЧНастройкиПользователей();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТЧНастройкиПользователей(Команда)
	КомандаЗаполнитьТЧНастройкиПользователейНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТЧНастройкиПользователейНаКлиенте()
	КомандаЗаполнитьТЧНастройкиПользователейНаСервере();
	Если Объект.ТЧНастройкиПользователей.Количество() = 0 Тогда
		Сообщить("Не требуется дозаполнять настройки пользователей");
	Конецесли;	
КонецПроцедуры 

&НаСервере
Процедура КомандаСформироватьЗаписиНастройкиПользователейНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.СформироватьЗаписиНастройкиПользователей();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьЗаписиНастройкиПользователей(Команда)
	КомандаСформироватьЗаписиНастройкиПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьУчетнуюЗаписьДляОтправкиУведомлений(Команда)
	СистемнаяУчетнаяЗаписьЭлектроннойПочты = ПредопределенноеЗначение("Справочник.бпсУчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты");
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ключ",СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	ОткрытьФорму("Справочник.бпсУчетныеЗаписиЭлектроннойПочты.Форма.ФормаЭлемента",ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТЧНастройкиПользователейУстановитьФлажки(Команда)
	УстановитьФлажки(Объект.ТЧНастройкиПользователей,Истина);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(ТЧ,Пометка)
	Для каждого СтрокаТЧ из ТЧ цикл
		СтрокаТЧ.Пометка = Пометка;	
	Конеццикла;
КонецПроцедуры 

&НаКлиенте
Процедура КомандаТЧНастройкиПользователейСнятьФлажки(Команда)
	УстановитьФлажки(Объект.ТЧНастройкиПользователей,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТЧРегистрАдресацииСнятьФлажки(Команда)
	УстановитьФлажки(Объект.ТЧРегистрАдресации,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаТЧРегистрАдресацииУстановитьФлажки(Команда)
	УстановитьФлажки(Объект.ТЧРегистрАдресации,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Декорация1ЭтапНажатие(Элемент)
	ОткрытьФорму("Справочник.бпсТипыОбъектовБД.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭтап2Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсПредметыСогласований.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭтап3Нажатие(Элемент)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТЧРегистрАдресации;
	ЗаполнитьДляРегистраАдресацииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭтап4Нажатие(Элемент)
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаТЧНастройкиПользователей;
	КомандаЗаполнитьТЧНастройкиПользователейНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсТипыОбъектовБД.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсПодразделенияАдресации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсПредметыСогласований.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация5Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсРолиАдресации.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация4Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсУсловия.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация8Нажатие(Элемент)
	ОткрытьФорму("Справочник.бпсУчетныеЗаписиЭлектроннойПочты.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация6Нажатие(Элемент)
	ОткрытьФорму("Документ.бпсРегистрацияСтатусаОбъекта.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация13Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсНастройкиПользователей.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация10Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсРегистрАдресации.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация12Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсЗаблокированныеОбъекты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация11Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсСтатусыОбъектов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация14Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсОшибки.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация9Нажатие(Элемент)
	ОткрытьФорму("Обработка.бпсСтатусыСогласований.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура Декорация7Нажатие(Элемент)
	ОткрытьФорму("БизнесПроцесс.бпсСогласование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Декорация15Нажатие(Элемент)
	ОткрытьФорму("РегистрСведений.бпсСообщения.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРегистрАдресацииПоПредметуСогласованияНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект"); 
	ОбработкаОбъект.ЗаполнитьТЧРегистрАдресацииПоПредметуСогласования();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	УстановитьВидимостьДоступность();	
КонецПроцедуры 

&НаКлиенте
Процедура ПредметСогласованияПриИзменении(Элемент)
	Объект.ТЧРегистрАдресации.Очистить();
	Объект.ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователи = Ложь;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТолькоТеЗаписиДляКоторыхНеЗаполненыПользователиПриИзменении(Элемент)
	Объект.ТЧРегистрАдресации.Очистить();
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ТЧРегистрАдресацииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	СтрокаТЧРегистрАдресации = Элементы.ТЧРегистрАдресации.ТекущиеДанные;	
	Если СтрокаТЧРегистрАдресации <> Неопределено тогда
		СтрокаТЧРегистрАдресации.Пометка = Истина;	
	Конецесли;	
	
КонецПроцедуры
